#+title: Model System
#+startup: latexpreview inlineimages
#+latex_header: \usepackage{braket}
#+auto_tangle: t
#+property: header-args:julia :session jl :results silent
#+property: header-args :tangle ../scripts/DeltaSCFSOC.jl

** Wavefunction
Setup the wavefunction as a ~mutable struct~ using the quantum numbers as a basis. This will create a vector where each element is a state defined by the quantum numbers

#+begin_src julia
@doc raw"""
    Wavefunction(n::Int64)

Define a wavefunction for a given n in a basis of $l$, $m_l$, and $m_s$

The length of the wavefunction vector is given by
```math
\sum_{n=1}^{n} \sum_{l=0}^{n-1} 2(2l + 1)
```

# Examples
```jldoctest
julia> Ψ = Wavefunction(2)
```
"""
mutable struct Wavefunction
    Ψ::Vector{Tuple{Int64,Complex{Int64},ComplexF64}}
    l::Vector{Int16}
    m_l::Vector{Complex{Int64}}
    m_s::Vector{ComplexF64}

    function Wavefunction(n::Int64)
        # Ensure n is greater than 0
        if n < 0
            throw(ArgumentError("n must be ∈ ℕ₀"))
        end

        # Calculate the total number of combinations
        len_Ψ = sum((2 * l + 1) * 2 for l = 0:n-1)

        # Create a matrix for all possible values of quantum numbers
        Ψ = Vector{Tuple{Int64,Complex{Int64},ComplexF64}}(undef, len_Ψ)

        idx = 1
        for l = 0:n-1
            for m_l = -l:l
                for m_s = -0.5:0.5
                    Ψ[idx] = (l, m_l, m_s)
                    idx += 1
                end
            end
        end

        # Save vectors of the quantum numbers
        l = [Ψ[i][1] for i = 1:len_Ψ]
        m_l = [Ψ[i][2] for i = 1:len_Ψ]
        m_s = [Ψ[i][3] for i = 1:len_Ψ]

        new(Ψ, l, m_l, m_s)
    end
end
#+end_src

Now, initialise the wavefunction when $$n=2$$

#+begin_src julia :results replace :tangle no :exports code
Ψ = Wavefunction(2)
#+end_src

#+RESULTS:
: Wavefunction(Tuple{Int64, Complex{Int64}, ComplexF64}[(0, 0 + 0im, -0.5 + 0.0im), (0, 0 + 0im, 0.5 + 0.0im), (1, -1 + 0im, -0.5 + 0.0im), (1, -1 + 0im, 0.5 + 0.0im), (1, 0 + 0im, -0.5 + 0.0im), (1, 0 + 0im, 0.5 + 0.0im), (1, 1 + 0im, -0.5 + 0.0im), (1, 1 + 0im, 0.5 + 0.0im)], Int16[0, 0, 1, 1, 1, 1, 1, 1], Complex{Int64}[0 + 0im, 0 + 0im, -1 + 0im, -1 + 0im, 0 + 0im, 0 + 0im, 1 + 0im, 1 + 0im], ComplexF64[-0.5 + 0.0im, 0.5 + 0.0im, -0.5 + 0.0im, 0.5 + 0.0im, -0.5 + 0.0im, 0.5 + 0.0im, -0.5 + 0.0im, 0.5 + 0.0im])

